{
  "sessions": [
    {
      "title": "Building India’s AI Ecosystem: From Vision to Sovereignty",
      "type": "Keynote",
      "speakers": [
        {
          "name": "Pratyush Kumar",
          "designation": "Co-Founder"
        }
      ],
      "about": "As AI becomes a cornerstone of global influence, India must chart its own path, not to isolate, but to securestrategic autonomy. This session explores why developing aSovereign AI Ecosystemis critical for addressing India’s unique socio-economic and linguistic diversity, while ensuring our voice shapes the global AI discourse. We'll discuss the urgent need fordomestic investment in compute and storage infrastructure, enabling foundational model development to remain within national borders, delivering resilience, control, and security at scale. Equally vital is nurturing an AI innovation ecosystem whereIndian developers, startups, and researchersbuild solutions rooted in local relevance with global potential. Finally, we’ll spotlight the importance ofhands-on GenAI educationto cultivate a deep talent pipeline and fuel long-term innovation. Join us to understand how India can lead responsibly in the AI era—with strength, inclusivity, and sovereignty at its core.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/building-indias-ai-ecosystem-from-vision-to-sovereignty"
    },
    {
      "title": "Responsible AI in Medical Imaging – A Case Study",
      "type": "Keynote",
      "speakers": [
        {
          "name": "Dr. Geetha Manjunath",
          "designation": "Founder and CEO"
        }
      ],
      "about": "Artificial Intelligence is transforming medical imaging by enabling faster, more consistent, and often more accurate diagnosis. However, the integration of AI into clinical workflows demands a responsible approach that prioritizes patient safety, fairness, and transparency. This talk will explore the core principles of Responsible AI in medical imaging, including the need for robust validation, bias mitigation, explainability, and data privacy. As a case study, we will examineThermalytix, an AI-powered breast cancer screening solution and how Responsible AI principles were applied to ensure accuracy, equity, and trust in real-world public health programs. Attendees will gain insights into building and deploying AI systems that not only scale but also uphold the highest standards of ethical healthcare innovation.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/responsible-ai-in-medical-imaging-a-case-study"
    },
    {
      "title": "Inclusive AI and Open Challenges",
      "type": "Keynote",
      "speakers": [
        {
          "name": "Manish Gupta",
          "designation": "Senior Director"
        }
      ],
      "about": "In this session, we begin by presenting the recent advances in the area of artificial intelligence, and in particular, foundation models, which are giving rise to the hope that artificial general intelligence capability is achievable in a not too distant future. We describe the tremendous progress of these models on problems ranging from understanding, prediction and creativity on one hand, and open technical challenges like safety, fairness and transparency on the other hand. These challenges are further amplified as we seek to advance Inclusive AI to tackle problems for billions of human beings in the context of the Global South. We will present our work on improving multilingual capabilities and cultural understanding of foundation models like Gemini, and on improving the computational efficiency of LLMs to enable scaling them to serve billions of people. We then showcase how the multimodal and agentic capabilities of these models have the potential to unlock transformative applications like personalized learning for everyone. We will also describe our work on analysis of satellite imagery to help transform agriculture and improve the lives of farmers. Through these examples, we hope to convey the excitement of the potential of AI to make a difference to the world, and also a fascinating set of open problems to tackle.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/keynote-session"
    },
    {
      "title": "Keynote Session",
      "type": "Keynote",
      "speakers": [
        {
          "name": "Srikanth Velamakanni",
          "designation": "Co-Founder, Group Chief Executive & Executive Vice-Chairman"
        }
      ],
      "about": "",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/keynote-session-2"
    },
    {
      "title": "A Visual Guide to Attention Mechanism in LLMs",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Luis Serrano",
          "designation": "Founder and Chief Education Officer"
        }
      ],
      "about": "The attention mechanism is a revolutionary leap that helped Large Language Models generate text in a sensical way. In a nutshell, attention adds context to words in an embedding. In this talk, we'll see attention as a gravitational force that acts between words, adding context to text. We'll study the keys, queries, and values matrix, and how they contribute to this theory of word gravitation.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/a-visual-guide-to-attention-mechanism-in-llms"
    },
    {
      "title": "Why GenAI and LLMs Fail and How Fine-Tuning Helps Them",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Vijay Gabale",
          "designation": "Co-Founder and CPO"
        }
      ],
      "about": "Despite their impressive capabilities, Large Language Models (LLMs) still struggle with tasks that require understanding simple, generalized concepts, things that come naturally to humans. In this talk, we’ll walk through real-world yet intuitive examples where even state-of-the-art LLMs fail to apply basic logic. But there’s a silver lining: with minimal, domain-specific fine-tuning, these models can rapidly learn the underlying rules and dramatically improve performance on the same tasks they initially fumbled. We’ll showcase case studies across BFSI, retail, and healthcare to demonstrate this transformation in action. Whether you’re building GenAI-powered solutions or evaluating their deployment in critical workflows, this session will offer practical insights into pushing LLMs beyond their limitations using lightweight, high-impact fine-tuning techniques. A must-attend for AI practitioners who want to turn GenAI into a precision tool, not just a powerful one.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/why-genai-and-llms-fail-and-how-fine-tuning-helps-them"
    },
    {
      "title": "Onboarding AI Agents with Human Values",
      "type": "PowerTalk",
      "speakers": [
        {
          "name": "Syed Quiser Ahmed",
          "designation": "AVP and Head of Infosys Responsible AI Office"
        }
      ],
      "about": "As AI evolves from machine learning models and LLMs to Autonomous AI agents, the nature of threats is rapidly shifting, from data bias and hallucinations to agents taking actions misaligned with human intent. This session explores how autonomous AI agents differ fundamentally in behavior, decision-making, and risk. We’ll discuss why traditional governance is no longer enough, and outline practical strategies to embed human values during onboarding and ensuring these agents act with responsibility, purpose, and alignment from the start.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/onboarding-ai-agents-with-human-values"
    },
    {
      "title": "Zero to Million: How GenAI Agents are Changing Performance Marketing",
      "type": "PowerTalk",
      "speakers": [
        {
          "name": "Krishna Kumar Tiwari",
          "designation": "Co-Founder & CTO"
        }
      ],
      "about": "Generative AI is moving fast — and it’s no longer just about writing ad copy or creating visuals. We’re now entering an era where AI agents can think, decide, and create at scale, transforming how brands connect with their customers. In this talk, We’ll see how we can use GenAI and agentic systems to take marketing from one-size-fits-all to millions of personalized creatives, tailored for individual personas, channels, and moments — all in real time. In this session, we will walk through: Whether you are building AI products, running marketing ops, or just GenAI-curious — this session will leave you with real-world insights, architectures, and ideas you can take back to your team.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/zero-to-million-how-genai-agents-are-changing-performance-marketing"
    },
    {
      "title": "Building Effective Agentic AI Systems: Lessons from the Field",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Dipanjan Sarkar",
          "designation": "Head of Artificial Intelligence & Community"
        }
      ],
      "about": "Everyone is building AI agents, but how do you designAgentic AI Systemsthat are truly reliable in the real-world? Agentic AI systems can plan tasks, use tools, reflect on results, and even collaborate with other agents. But building them at scale brings challenges: This session draws from my personal experience building and deploying Agentic AI systems over the past year. We’ll focus on three pillars:Architecting,Optimizing, andObservabilityforAgentic AI Systems.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/building-effective-agentic-ai-systems-lessons-from-the-field"
    },
    {
      "title": "Search Query Optimization Using Retrieval-Augmented Generation (RAG)",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Pankaj Agarwal",
          "designation": "Senior Software Engineer - Machine Learning"
        }
      ],
      "about": "In the world of online food delivery, user search queries are often vague, incomplete, or noisy — like \"best pizza\", \"veg thali under 200\", or \"birynai\" (yes, with a typo). This talk explores how Retrieval-Augmented Generation (RAG) can help rewrite such queries into more precise and intent-aware forms, improving both relevance and user experience. We’ll cover the core concepts behind RAG, how it combines external retrieval with generative language models, and how it compares to traditional query rewriting approaches. The session will wrap up with a hands-on demo showcasing a real-world use case in the online food delivery space, illustrating how RAG can be used to bridge the gap between user intent and search results.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/search-query-optimization-using-retrieval-augmented-generation-rag"
    },
    {
      "title": "RIP, Data Scientists",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Anand S",
          "designation": "LLM Psychologist"
        }
      ],
      "about": "In this talk, we will explore how Large Language Models (LLMs) can autonomously perform tasks traditionally handled by data scientists. Using live coding, we will demonstrate how LLMs can explore a dataset, generate hypotheses, write and test code, and fix issues as they arise. We'll also cover how LLMs can test statistical significance, draw charts, and interpret results-capturing the essence of what a data scientist does. Additionally, we'll discuss the evolving role of human data scientists in a world where LLMs can handle so much of the data science workflow, and examine where human expertise will still be essential in the process.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/rip-data-scientists"
    },
    {
      "title": "MassGen: Scaling AI Through Multi-Agent Collaboration",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Chi Wang",
          "designation": "Co-creator and Co-founder"
        }
      ],
      "about": "Discover how multi-agent systems are revolutionizing AI performance beyond single-model limitations. Built on insights from AG2, Gemini Deep Think, Grok Heavy, and \"Myth of Reasoning\", MassGen orchestrates diverse AI agents (Claude, Gemini, GPT, Grok) to collaborate in real-time, mimicking human \"study group\" dynamics. This session will showcase the architecture that enables cross-model/agent synergy, parallel processing, and iterative refinement through live demonstrations including creative writing consensus, travel planning intelligence sharing, and complex problem-solving. Learn how agents naturally converge on superior solutions through collaborative reasoning rather than isolated thinking. We'll demonstrate the open-source framework, share real case studies, and explore the future of recursive agent bootstrapping. Join us to see how the next evolution of AI isn't about bigger models, it's about smarter collaboration.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/massgen-scaling-ai-through-multi-agent-collaboration"
    },
    {
      "title": "Productionizing Agents : An Agent Factory Approach",
      "type": "PowerTalk",
      "speakers": [
        {
          "name": "Krishnakumar Menon",
          "designation": "Technology Partner"
        }
      ],
      "about": "In this talk, we’ll walk through how we approach agent development at Tiger - from the first idea to getting agents into production. We’ll cover what it takes to build and manage agents at scale, and share some of the practical things we’ve learned along the way. Expect a deep dive into our Agent Platform - how we think about agent architectures, context engineering, observability, and more. Most importantly, we’ll talk about how a data flywheel mindset has helped us move faster, improve agent behavior, and make better decisions at every stage.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/productionizing-agents-an-agent-factory-approach"
    },
    {
      "title": "Building Responsible AI Agents with Guardrails and Safety in Action",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Anuj Saini",
          "designation": "Director Data Science"
        }
      ],
      "about": "In this practical session, participants will learn how to build autonomous AI agents using open-source LLMs and apply responsible AI principles through real-world guardrailing techniques. We will walk through the full pipeline — from creating a task-specific agent using LLaMA or Mistral-based models, to integrating NVIDIA NeMo Guardrails, Llama Guard, and prompt-based safety strategies. We’ll cover critical safety challenges such as: This session will include:",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/building-responsible-ai-agents-with-guardrails-and-safety-in-action"
    },
    {
      "title": "Red Teaming GenAI: Securing Systems from the Inside Out",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Shivaraj Mulimani",
          "designation": "Security Data Scientist"
        },
        {
          "name": "Satnam Singh",
          "designation": "Chief Data Scientist"
        }
      ],
      "about": "In today’s AI-driven world, traditional cybersecurity isn’t enough. Generative AI systems can be exploited in new and unexpected ways—and that’s where AI Red Teaming comes in. Think of it as offensive security for your models, probing them before real attackers do.In this hands-on session, we’ll unpack how red teaming works for GenAI: from simulating real-world attacks and prompt injection to uncovering hidden, risky capabilities. You’ll learn practical methodologies adversarial simulation, targeted testing, and capability evaluation, as well as how to operationalize them at scale.We’ll also explore frameworks like the MITRE ATLAS Matrix, compliance alignment with NIST AI RMF and the EU AI Act, and must-know tools like Garak, PyRIT, and ART.By the end, you’ll walk away with a practical playbook to proactively harden your AI systems, detect emerging threats, and build secure, responsible GenAI applications before adversaries get there first.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/red-teaming-genai-securing-systems-from-the-inside-out"
    },
    {
      "title": "Vibe Coding Showdown: Building Applications with AI Assistants",
      "type": "Hack Panel",
      "speakers": [
        {
          "name": "Kunal Jain",
          "designation": "Founder & CEO"
        },
        {
          "name": "Ravi RS Nadimpalli",
          "designation": "Growth PM"
        },
        {
          "name": "Anand S",
          "designation": "LLM Psychologist"
        },
        {
          "name": "Anuvrat Parashar",
          "designation": "Founder"
        }
      ],
      "about": "What happens when developers hand off part of the heavy lifting to AI? In theVibe Coding Showdown, three panelists-from different technical backgrounds-set out to solve the same ambitious app challenge using AI-powered coding assistants. The result? Three applications, each built with a mix of human intent and machine-generated code. This session walks you through how they did it-how AI helped brainstorm, build, debug, and refine complex apps using just natural language, iterative feedback, and smart tooling. Whether you’re a developer or just AI-curious, you’ll see how AI is shifting the way we approach software creation.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/vibe-coding-showdown-building-applications-with-ai-assistants"
    },
    {
      "title": "How GenAI is Being Leveraged in the Web3 Ecosystems",
      "type": "PowerTalk",
      "speakers": [
        {
          "name": "Rohan Rao",
          "designation": "Gen AI Expert"
        }
      ],
      "about": "This session explores how Generative AI is transforming the Web3 ecosystem and the virtual digital assets space. We’ll look at its role in decentralization, tokenization, and portfolio management, as well as practical use cases in NFTs, token utilities, smart contracts, and blockchain analytics. The discussion will cover how GenAI is enhancing crypto security through AI-driven vulnerability and attack detection, along with the challenges, risks, and regulatory considerations of automating virtual and synthetic economies. We’ll also dive into the innovations and future possibilities emerging at the intersection of GenAI and Web3.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/how-genai-is-being-leveraged-in-the-web3-ecosystems"
    },
    {
      "title": "Building Blocks of Successful AI",
      "type": "PowerTalk",
      "speakers": [
        {
          "name": "Abhishek Sharma",
          "designation": "Principal AI Engineer"
        }
      ],
      "about": "With AI advancing at an unprecedented pace and the industry constantly chasing the latest trends and models, it’s easy to fall victim to “shiny object syndrome.” But if we want to build AI systems that truly succeed, this is exactly what we need to avoid. In this session, we will go back to the basics and explore the core building blocks of successful AI. Drawing from real-world examples, we’ll uncover why the most impactful AI applications aren’t built by teams chasing the hype. They’re built by teams who master the fundamentals everyone else overlooks.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/building-blocks-of-successful-ai"
    },
    {
      "title": "Agentic AI Meets Responsible AI: Designing Safe Autonomous Systems",
      "type": "PowerTalk",
      "speakers": [
        {
          "name": "Praveen Kumar GS",
          "designation": "Senior Director"
        }
      ],
      "about": "As Artificial Intelligence matures from predictive systems to autonomous, goal-driven agents, the convergence of Agentic AI and Responsible AI becomes not just essential—but inevitable. This talk explores the dynamic intersection where the empowerment of intelligent agents meets the ethical guardrails of responsible design. Agentic AI systems are capable of perception, decision-making, and autonomous action, often orchestrating complex tasks with minimal human oversight. While this unlocks immense potential—from personal assistants and self-optimizing systems to autonomous operations—it simultaneously introduces unprecedented challenges related to accountability, fairness, transparency, and control. This power talk delves into: By bridging agentic capabilities with ethical imperatives, this session aims to inspire technologists, leaders, and policymakers to co-create AI systems that are not only intelligent—but also accountable, safe, and deeply human-centered.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/agentic-ai-meets-responsible-ai-designing-safe-autonomous-systems"
    },
    {
      "title": "Evaluating GenAI Models: Case Studies in Enterprise and Healthcare",
      "type": "PowerTalk",
      "speakers": [
        {
          "name": "Dr. Kiran R",
          "designation": "Vice President of Engineering"
        }
      ],
      "about": "Generative AI is driving the biggest platform shift since the advent of the internet, transforming every industry by reshaping customer service, software development, marketing, HR, and beyond. However, many organizations face a gap between GenAI’s promise and its actual performance. Unlike traditional ML, GenAI systems are harder to evaluate due to their subjective, multimodal, and human-in-the-loop nature. This session explores the critical need for robust GenAI evaluation frameworks across technical aspects (like prompt evaluation, red teaming, and reproducibility), observability (including production logging and cost monitoring), and business metrics (such as ROI, service improvements, and responsible AI measures). We’ll contrast GenAI and traditional ML evaluation methods and introduce a holistic framework that includes ground truth creation via gold/silver datasets. Through real-world case studies in Enterprise and HealthTech—including recommender systems, auto form filling, de-identification, and structured note generation—we’ll show how to evaluate GenAI systems effectively both pre- and post-production. The session will highlight key tools and techniques that enhance GenAI evaluation usability, especially for complex tasks like summarization and compliance.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/evaluating-genai-models-case-studies-in-enterprise-and-healthcare"
    },
    {
      "title": "Adaptive Email Agents with DSPy: From Static Prompts to Smart Learning",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Praneeth Paikray",
          "designation": "Senior Generative AI Specialist"
        }
      ],
      "about": "",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/adaptive-email-agents-with-dspy-from-static-prompts-to-smart-learning"
    },
    {
      "title": "AutoGen vs CrewAI vs LangGraph: Battle of the Agent Frameworks",
      "type": "Hack Panel",
      "speakers": [
        {
          "name": "Dipanjan Sarkar",
          "designation": "Head of Artificial Intelligence & Community"
        },
        {
          "name": "Praneeth Paikray",
          "designation": "Senior Generative AI Specialist"
        },
        {
          "name": "Mayank Aggarwal",
          "designation": "Co-Founder & CEO"
        },
        {
          "name": "Sanathraj Narayan",
          "designation": "Data Science Manager"
        }
      ],
      "about": "Get ready for a high-stakes AI face-off as three leading multi-agent frameworks -AutoGen,CrewAI, andLangGraph,go head-to-head solving thesame real-world AI problem: Building a Multi-Agent Helpdesk AI Assistant. Watch top Agentic AI practitioners demonstrate how each framework tackles this challenge: from structuring agent teams to orchestrating decisions across multiple steps. This unique session combines live hands-on demos and a panel discussion. You’ll walk away with a clear view of what each framework does best, where they struggle, and how to pick the right one for your next Agentic AI project.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/autogen-vs-crewai-vs-langgraph-battle-of-the-agent-frameworks"
    },
    {
      "title": "Empowering Data Insights with Large Language Models",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Aditya Iyengar",
          "designation": "Technology Lead"
        }
      ],
      "about": "In today's data-driven world, extracting meaningful insights quickly is paramount. Our AI analytics platform redefines this process by harnessing the transformative power of Large Language Models (LLMs). Beyond traditional data analysis, our innovative accelerator, QLytics, leverages LLMs to seamlessly convert your complex legacy queries into optimized, cloud-native code for platforms like Databricks and Snowflake. This integration not only accelerates your migration to the cloud but also democratizes data access, allowing users to interact with data using natural language, summarize vast datasets, and uncover hidden patterns with unprecedented ease and speed. Experience a new era of intelligent data analytics, where insights are just a conversation away.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/empowering-data-insights-with-large-language-models"
    },
    {
      "title": "Automate Everything: Building Agentic AI Workflows with No-Code Tools",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Mayank Aggarwal",
          "designation": "Co-Founder & CEO"
        }
      ],
      "about": "In this hands-on session, we’ll explore how no-code automation platforms—especially the open-source tooln8n—can be combined with powerfulAI agentsto build intelligent, production-ready workflows. Whether you’re a data professional, developer, or automation enthusiast, this session will demystify how you can go from a manual task to a fully orchestratedAI-powered agent-all without writing full applications.With a blend of humor, visual storytelling, and real-world case studies, we’ll walk through building anAI Literature Review Assistantusing AI agents and no-code automation. We’ll dive deep into: - The automation landscape (Zapier, Make, Bubble, n8n) - What agentic AI means, from basic bots to AutoGPT-style workflows - How n8n enables flexible AI orchestration - How to design and run autonomous AI workflows usingvisual tools By the end of this session, you’ll understand how todesign agentic AI workflowsthat use LLMs, APIs, and no-code builders to automate even research and decision-heavy processes.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/automate-everything-building-agentic-ai-workflows-with-no-code-tools"
    },
    {
      "title": "Saving Ananya: A Brand’s GenAI Playbook for Enhanced CX",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Pavak Biswal",
          "designation": "Senior Manager - Insights & Analytics, Data Products"
        },
        {
          "name": "Abhilash Kulkarni",
          "designation": "Senior Analyst - Insights & Analytics, Data Products"
        }
      ],
      "about": "What if brands could anticipate customer needs, prevent frustration and resolve issues before they even arise?",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/saving-ananya-a-brands-genai-playbook-for-enhanced-cx"
    },
    {
      "title": "From LLMs to Agentic AI: Solving New Problems with Multi-Agent Systems",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Alessandro Romano",
          "designation": "Senior Data Scientist"
        }
      ],
      "about": "In this Hack Session, we’ll explore the evolution from large language models (LLMs) to agentic AI—highlighting how this shift opens the door to solving a new class of complex, dynamic problems. We’ll look at what makes agentic systems different, why they matter, and how they’re already transforming workflows and applications. We’ll walk through a high-level use case and demonstrate how frameworks like CrewAI make designing, orchestrating, and deploying these systems easier. This session is meant to inspire developers, researchers, and builders to rethink how they approach problem-solving with LLMs—moving from one-off prompts to collaborative, goal-driven agents.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/from-llms-to-agentic-ai-solving-new-problems-with-multi-agent-systems"
    },
    {
      "title": "LLMs Are Boring. How Can We Make Them More Interesting?",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Harshad Khadilkar",
          "designation": "Lead Data Scientist"
        }
      ],
      "about": "Today's LLMs, and in a broader sense agentic workflows and RAG, are excellent at retrieval, summarization, and conversation. They have also been given quantitative skills by providing access to tools. However, their outputs are rarely novel or surprising. In other words, their outputs are generally boring. The focus of this talk will be on exploring ways to make the outputs more interesting. We will look at well-known approaches such as training diversity and higher temperature, but we will go on to explore ways which inject novelty more organically, through sources of directed randomness. The north star of this effort is to enable generative AI to perform effective discovery, rather than stick to the beaten path.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/llms-are-boring-how-can-we-make-them-more-interesting"
    },
    {
      "title": "Quantifying Our Confidence in Neural Networks and AI",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Joshua Starmer",
          "designation": "Founder and CEO"
        }
      ],
      "about": "Although Large Language Models and AI are known to generate false and misleading responses to prompts, relatively little effort has gone into understanding how we can quantify the confidence we should have in the output from these models. In this hack session, the speaker will illustrate the problem using a simple neural network and then demonstrate two methods for quantifying our confidence in the model outputs. He will then show how these methods can be applied to Large Language Models and AI.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/quantifying-our-confidence-in-neural-networks-and-ai"
    },
    {
      "title": "Understanding AI Agents with MCP",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Nitin Agarwal",
          "designation": "Principal Data Scientist"
        },
        {
          "name": "Rutvik Acharya",
          "designation": "Principal Data Scientist"
        }
      ],
      "about": "This session introduces theModel Context Protocol (MCP), an open standard developed by Anthropic to streamline how AI agents interact with external tools and data sources. Attendees will gain a foundational understanding of MCP's client-server architecture and how it standardizes communication with systems such as databases and APIs. By reducing custom integration overhead, MCP enables modularity, improved automation, and scalable agent workflows. The session includes a live demonstration showcasing how MCP connects AI agents to real-world tools, offering practical insights for developers and AI practitioners.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/understanding-ai-agents-with-mcp"
    },
    {
      "title": "AI Voice Agent: The Future of Human-Computer Interaction",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Manoranjan Rajguru",
          "designation": "AI Architect"
        },
        {
          "name": "Ranjani Mani",
          "designation": "Director and Country Head, Generative AI, India and South Asia"
        }
      ],
      "about": "Voice is fast becoming the most natural and intuitive way for humans to interact with machines. With the rise of AI-powered voice agents, we're entering a new era where conversations, not clicks, drive digital experiences. This session explores how advancements in generative AI, speech recognition, and real-time synthesis are reshaping human-computer interaction. Discover the latest trends, architectures, and real-world use cases where AI voice agents are revolutionizing industries—from customer service to healthcare and beyond. Join us to understand the future possibilities and what it takes to build intelligent, responsive, and human-like voice interfaces.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/ai-voice-agentfuture-of-human-computer-interaction"
    },
    {
      "title": "Automating Vehicle Inspections with Multimodal AI and Gemini on GCP",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Vignesh Kumar",
          "designation": "AI Engineering Manager"
        }
      ],
      "about": "Ensuring customer transparency through electronic Video Health Checks (eVHC) is crucial in the automotive service sector, yet processing millions of videos annually presents a significant scaling challenge for manual review. This session explores leveraging multimodal Generative AI, specifically Google's Gemini models on GCP, to automate the analysis of high-volume eVHC videos within the automotive industry. We will dissect a practical implementation, showcasing an end-to-end serverless architecture built on Google Cloud for this use case. Learn how to handle data ingestion, video retrieval, and utilize Vertex AI and Gemini Flash for automated content extraction and summarization, deployed efficiently via Cloud Run. We'll discuss the potential for improved operational efficiency, scalability, cost reductions, and significant uplifts in key customer metrics like satisfaction scores and value per service visit. Join this session for actionable insights into deploying multimodal AI for video analysis, building robust serverless AI workflows on GCP, and translating AI capabilities into measurable business impact across the automotive service landscape.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/automating-vehicle-inspections-with-multimodal-ai-and-gemini-on-gcp"
    },
    {
      "title": "Deploying GenAI Safely: Strategies for Trustworthy LLMs",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Gauri Kholkar",
          "designation": "Machine Learning Engineer"
        }
      ],
      "about": "This talk will explore the critical aspects of securing GenAI applications, beginning with the unique security challenges they introduce. We will examine key vulnerabilities in depth, including manipulative prompt injection attacks, jailbreaks designed to bypass safety controls, risks related to sensitive data leakage, the generation of inaccurate hallucinations, and the dangers of improper model output handling. The agenda focuses on providing actionable insights through effective mitigation strategies, methods for early vulnerability identification, and adherence to proven best practices, ultimately aiming to equip attendees with the knowledge to build secure, resilient, and trustworthy LLM-powered systems while minimizing deployment risks.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/deploying-genai-safely-strategies-for-trustworthy-llms"
    },
    {
      "title": "Beyond PoCs: Building Real-World Agentic Systems",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Miguel Otero Pedrido",
          "designation": "ML Engineer|Founder"
        }
      ],
      "about": "In this hands-on session, we'll move beyond demos and PoCs to dive into how to build complex agentic systems that work in real-world scenarios. We’ll start by covering the fundamentals of agents (short-term memory, long-term memory, tool use, reasoning techniques, etc), then introduce Agentic RAG and how it differs from traditional RAG, and show how to bring these concepts into production using LLMOps practices like agent monitoring, prompt versioning, dataset management and RAG evaluation. We'll wrap up with a real-time simulation of agents operating inside a video game, seeing all these concepts come to life in action.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/beyond-pocs-building-real-world-agentic-systems"
    },
    {
      "title": "Mastering Agentic Workflows with LangGraph",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Sanathraj Narayan",
          "designation": "Data Science Manager"
        }
      ],
      "about": "This session on LangGraph is on building graph-based LLM workflows. We will explore agent architectures with memory and tools, implement reflexion loops for self-improvement, and build intelligent systems that combine retrieval and reasoning through agentic RAG. We'll also cover tracing and experiment tracking",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/building-intelligent-workflows-with-langgraph-from-agent-fundamentals"
    },
    {
      "title": "Towards Sustainable AI: Effective LLM Compression Techniques",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Ruchi Awasthi",
          "designation": "Machine Learning Engineer, CTO Office"
        }
      ],
      "about": "Imagine a world where AI is as eco-friendly as it is intelligent. This session is for anyone who wants to make artificial intelligence more practical and less expensive. As the computational demands of Large Language Models (LLMs) continue to grow, their deployment challenges in terms of cost, energy consumption, and hardware requirements become increasingly significant. This session aims to address these challenges by exploring a range of effective model compression techniques that reduce the size and computational overhead of LLMs without compromising their performance. In this presentation, we will touch base the following High-Level Concepts of LLM Compression 1. Pruning: Technique to remove redundant or less important parameters from the model. 2. Knowledge Distillation: Training a smaller model (student) to replicate the behavior of a larger model (teacher). 3. Low-Rank Factorization: Decomposing large weight matrices into products of smaller matrices, reducing the number of parameters and computations. 4. Quantization: Reducing the precision of the model parameters. Join us to explore simple, effective ways to reduce the size of these models using techniques like pruning, quantization, knowledge distillation, and low-rank factorization. We'll break down each method in easy-to-understand terms and infographics, explaining what these techniques do, why they are beneficial, what are different categories under each one of them and how they can be applied in real-life scenarios.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/towards-sustainable-ai-effective-llm-compression-techniques"
    },
    {
      "title": "From Language to Robotics: Practical Lessons Bridging LLMs, RL, and AI",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Logesh Kumar Umapathi",
          "designation": "Machine Learning Consultant"
        }
      ],
      "about": "In recent years, large language models (LLMs) have redefined what machines can do with text. But language alone is not enough when the goal is true intelligence — grounded, embodied, and interactive. In this session, the speaker will share his ongoing journey from working with LLMs, Language agents and natural language processing to diving deep into the world of reinforcement learning and robotics.Logesh will walk through how the intuitions developed in NLP & LLMs — translate (or don't) into embodied learning systems. He will explore some of the key concepts for making the transition, and his practical learning and struggles of building and training a robotic arm ( LeRobot and So-100). Of course, including a live demo featuring my robotic arms.Whether you're a curious NLP expert or an RL enthusiast seeking cross-domain insights, this session offers practical wisdom, reflections, and guidance to navigate your next leap.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/from-language-to-robotics-practical-lessons-bridging-llms-rl-and-ai"
    },
    {
      "title": "Agentic Knowledge Augmented Generation: The Next Leap After RAG",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Arun Prakash Asokan",
          "designation": "Associate Director Data Science"
        }
      ],
      "about": "In the world of Generative AI, Retrieval-Augmented Generation (RAG) has been a game-changer, but it's time to push the boundaries even further. In this session, we’ll explore the next evolution: Agentic Knowledge Augmented Generation (Agentic KAG). We’ll dive into how to build Knowledge Graphs from unstructured data, use Graph Databases to organize and connect information meaningfully, and design autonomous AI agents using LangGraph to navigate and reason over these graphs. By moving beyond simple retrieval, Agentic KAG enables LLMs to generate knowledge-rich, contextual, and insightful outputs — overcoming key challenges faced by traditional RAG and agentic RAG systems. Whether you're a developer, architect, or AI enthusiast, this session will give you a hands-on understanding of how to supercharge your LLM applications with agents and graphs.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/agentic-knowledge-augmented-generation-the-next-leap-after-rag"
    },
    {
      "title": "Collaborative Multi-Agent Framework for Robust SEO Content Generation",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Anshu Kumar",
          "designation": "Lead Data Scientist"
        }
      ],
      "about": "Explore a modular and resilient agent framework designed for SEO content generation. Discover how multiple specialized agents can work in harmony, each assigned to critical tasks such as page summarization, FAQ generation, and snippet creation, to streamline the production of high-quality, search-optimized content.Learn how these agents collaborate seamlessly through validation and rewriting stages, ensuring consistency and strong SEO performance. The session offers practical insights into building scalable, fault-tolerant workflows that enhance efficiency and accuracy in AI-driven digital marketing environments.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/collaborative-multi-agent-framework-for-robust-seo-content-generation"
    },
    {
      "title": "Fast and Accurate Conversational Agents: Beyond Function Calling",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Daksh Varshneya",
          "designation": "Senior Product Manager"
        }
      ],
      "about": "Voice-based GenAI assistants promise a new era of intuitive interaction—but making them fast and reliable is still a major challenge. This session cuts through the hype to explore what it really takes to build high-performance conversational agents that users can trust. We’ll start by comparing popular LLMs in real-world agentic scenarios, analyzing where they shine—and where they stumble—especially when balancing accuracy with response speed. Then, we introduce CALM: a structured framework for designing responsive, trustworthy AI agents, built with latency, precision, and user trust in mind. You’ll also learn a semi-automated fine-tuning workflow that combines data augmentation and model distillation—empowering smaller models like Llama 3 8B to rival GPT-4o in accuracy, at 3x the speed. The session wraps with a live demo and full access to code and slides. Whether you’re building voice agents or scaling assistant infrastructure, this session is packed with practical insights you can apply today.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/building-fast-and-accurate-llm-agents-with-the-calm-framework"
    },
    {
      "title": "Model Context Protocol in Media: Choosing the Right Metrics & Strategy",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Hitesh Nayak",
          "designation": "Senior Director - Data Sciences"
        }
      ],
      "about": "This session unveils how intelligent agents leverage large language models and agentic frameworks to execute key media and marketing tasks across Paid, Organic, and SEO channels. Witness firsthand as an agent: Attendees will gain insights into the agent's operational flow, understand the underlying architecture enabling these actions, and learn how the Model Context Protocol (MCP) ensures alignment with strategic marketing objectives. The session will emphasize how to define robust evaluation criteria and measurement strategies for these AI-driven workflows, ultimately leading to more informed decisions and enhanced marketing effectiveness.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/model-context-protocol-in-media-choosing-the-right-metrics-strategy"
    },
    {
      "title": "Vibe Coding in Action: Building Real Applications with AI Assistance",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Tanika Gupta",
          "designation": "Director Data Science"
        }
      ],
      "about": "Software development is entering a new era where creativity, not just coding skills, drives innovation. With the rise of AI-powered coding assistants, \"vibe coding\" is transforming how we build from writing every line manually to collaborating seamlessly with AI. This session dives into the emerging practice of vibe coding, where describing ideas and guiding AI replaces traditional programming workflows. Explore how advancements in large language models, AI code generation, and natural language interfaces are reshaping software creation. Discover how developers are leveraging AI tools to build faster, prototype effortlessly, and unlock new possibilities with minimal friction. To bring these ideas to life, I will also showcase a live demo on how you can build real applications using vibe coding techniques.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/vibe-coding-in-action-building-real-applications-with-ai-assistance"
    },
    {
      "title": "Full-Stack Agentic AI: Build, Evaluate, and Scale with NVIDIA Tools",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Saurav Agarwal",
          "designation": "Solutions Architecture and Engineering"
        }
      ],
      "about": "Build, Evaluate, and Optimize Full-Stack AI Agent Systems for Real-World Applications Agentic AI systems, which are complex workflows that integrate multiple AI agents, are becoming essential for organizations aiming to automate intricate processes, improve decision-making, and provide seamless digital experiences. NVIDIA Agent Intelligence is an open-source toolkit designed to simplify, optimize, and accelerate the development and evaluation of robust, full-stack agentic AI solutions. In this session, you'll gain an in-depth understanding of NVIDIA Agent Intelligence toolkit and how to leverage its powerful features to connect, evaluate, and scale your AI agent teams. We'll explore how it simplifies development, enables fine-grained telemetry for enhanced performance, and facilitates detailed accuracy assessments of agentic workflows. Discover how to rapidly prototype AI agent systems, integrate the generative AI pipeline.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/full-stack-agentic-ai-build-evaluate-and-scale-with-nvidia-tools"
    },
    {
      "title": "Measuring Uncertainty in LLMs and Optimal Use of SLMs",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Kuldeep Jiwani",
          "designation": "VP, Head of AI Solutions"
        }
      ],
      "about": "LargeLanguageModels (LLMs)areredefiningNLPwiththeirremarkablereasoningcapabilities,buttheystillhallucinate,makingupfactsthatcanderaildecision-criticaltaskslikeclinicaltrialmatchingormedicalentityextraction.Inthissession,we’llexplorehowunderstandingandquantifyinguncertaintycanhelptacklethisreliabilitygap. We’lldemystifyuncertaintyvs.confidence,breakdownaleatoricvs.epistemicuncertainty,andwalkthroughestimationtechniquesforwhite-box (e.g.,LLaMA),grey-box (e.g.,GPT-3),andblack-box (e.g.,GPT-4)models.Expecthands-ondemonstrationsusingopen-sourceLLMsandtools,witharealitycheckonwhySoftMaxscoresalonecanbemisleading. We’llalsoshineaspotlightonSmallLanguageModels (SLMs) onwhythey’renotjustcheaper,butpotentiallymorepredictableandcontrollable,offeringacompellingalternativeforhallucination-sensitiveusecases. Whetheryou'redeployingLLMsinproductionorexperimentingwithSLMs,thistalkwillequipyouwithtoolstomakeyourmodelsmoretrustworthy.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/measuring-uncertainty-in-llms-and-optimal-use-of-slms"
    },
    {
      "title": "Agent to Agent Protocol: Benefits and Workflows",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Avinash Pathak",
          "designation": "Senior AI Engineer"
        }
      ],
      "about": "The Agent2Agent (A2A) protocol addresses a critical challenge in the AI landscape: enabling gen AI agents, built on diverse frameworks by different companies running on separate servers, to communicate and collaborate effectively - as agents, not just as tools. A2A aims to provide a common language for agents, fostering a more interconnected, powerful, and innovative AI ecosystem.In this session, we will learn how A2A agents discover each other's capabilities, negotiate interaction modalities (text, forms, media), securely collaborate on long-running tasks, and operate without exposing their internal state, memory, or tools.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/agent-to-agent-protocol-benefits-and-workflows"
    },
    {
      "title": "Bridging the AI Agent Gap: Interoperability with A2A and MCP Protocols",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Nikhil Rana",
          "designation": "Senior Technical Solutions Consultant, AI"
        }
      ],
      "about": "The rapid growth of AI agents presents a significant challenge to building truly collaborative and scalable AI systems. This talk will introduce two complementary open protocols: Google's Agent-to-Agent (A2A) Protocol and Anthropic's Model Context Protocol (MCP). We'll explore how MCP enables individual AI models to seamlessly access and utilize external tools and data, while A2A facilitates robust communication and coordination among diverse AI agents. Through practical use cases and a concise demonstration, attendees will learn how the synergy of A2A and MCP addresses key interoperability challenges, fosters modularity, and paves the way for building sophisticated, multi-agent ecosystems in enterprise and beyond.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/bridging-the-ai-agent-gap-interoperability-with-a2a-and-mcp-protocols"
    },
    {
      "title": "Building Real-Time Multi-Agent AI for Public Travel Systems",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Manpreet Singh",
          "designation": "Data & Applied Scientist II"
        }
      ],
      "about": "RAHAT (Responsive AI Helper and Tasker) is a multi-agent AI system designed to assist railway and airport passengers by providing intelligent, real-time responses to various travel-related queries. From getting live train status, platform details, and ticket waitlist information to locating station facilities and calling for emergency assistance, RAHAT leverages LLM-based agents and tool integration to simulate smart, interactive terminals. With built-in memory, voice support (optional), and the potential for hardware integration (e.g., kiosks or mobile bots), RAHAT redefines the way public information is accessed and services are delivered.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/building-real-time-multi-agent-ai-for-public-travel-systems"
    },
    {
      "title": "The Promise and Pitfalls of Synthetic Data Generation",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Abhishek Divekar",
          "designation": "Senior Applied Scientist"
        }
      ],
      "about": "Synthetic data is transforming the landscape of training foundational models such as GPTs and Stable Diffusion, by enabling the creation of diverse, privacy-conscious, and annotation-efficient datasets. In this illuminating session, we will trace the frontier of synthetic data generation. We'll discuss generative AI techniques that are reshaping industries, demonstrating how synthetic datasets created by LLMs, diffusion models, and hybrids can augment or even replace traditional human-curated data. We'll highlight the pitfalls of careless generation at scale, including the amplification of hallucinations and entrenched biases, and offer practical strategies for safeguarding data quality. You'll learn how to ground synthetic data in real-world contexts, leveraging distributional similarity metrics and LLM-as-a-Judge to reliably benchmark synthetic versus human data. Join us to discover how responsible synthetic data practices can drive a more robust, ethical, and innovative AI-powered future.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/the-promise-and-pitfalls-of-synthetic-data-generationno-title"
    },
    {
      "title": "Creative AI Agents: Open Tools for Collaborative Media Creation",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Dhruv Nair",
          "designation": "Machine Learning Engineer"
        }
      ],
      "about": "AI doesn’t have to replace human creativity - it can enhance it. In this session, we explore how to build AI agents that act as collaborators in creative workflows, from visual design to multimedia storytelling. You’ll learn how to architect systems that support ideation, iteration, and refinement alongside human input. We’ll dive into how the ReAct agent framework can be tailored for creative tasks, enabling intelligent planning and feedback-driven media generation. Learn to integrate open-source tools like Stable Diffusion, Flux, LoRAs, and IPAdapters to turn creative briefs into coherent, high-quality visual outputs. But creating is only half the battle, we’ll also show how to build effective feedback loops using techniques like aesthetic scoring and user-in-the-loop editing to improve outputs in real time. Expect hands-on code, real-world examples, and practical takeaways to bring human-AI co-creation to life in your own design, content, or media pipeline.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/creative-ai-agents-open-tools-for-collaborative-media-creation"
    },
    {
      "title": "Architecting AI: Practical Patterns for Multi-Agentic Workflows",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Pranjal Singh",
          "designation": "Staff Data Scientist"
        }
      ],
      "about": "Agentic workflows combine specialized LLMs, tool usage, and validation techniques to solve complex, real-world tasks. In this session, we will walk through practical design patterns and strategies to build robust multi-agent systems that are scalable, grounded, and capable of self-correction. We will explore how to structure interactions between agents using routing, sequential chaining, and asynchronous orchestration. Through real-world demos, we’ll show how structured outputs, task guardrails, and grounding with multimodal models (VLMs, audio, OCR) can be combined to ensure reliable performance. This session is hands-on, code-rich, and designed to equip attendees with implementation-ready insights. The session will provide practical examples and demonstrations of multi-agent systems, including: asynchronously coordinating agents for parallel data processing or project management; sequential agent flows for tasks like document extraction, summarization, and translation; a Router Agent for directing customer support queries; a VLM agent for image analysis and object identification; a Query-to-Dashboard system for generating visualizations from natural language queries; and an audio processing agent that transcribes spoken commands and acts upon them.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/architecting-ai-practical-patterns-for-multi-agentic-workflows"
    },
    {
      "title": "Multi-Modal GenAI for Energy Infrastructure Inspection Reports",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Prakalp Somawanshi",
          "designation": "Principal AI Engineer"
        }
      ],
      "about": "As energy infrastructure evolves with the integration of renewables and digital operations, the need for intelligent and automated inspection systems is more critical than ever. This session explores how Multi-Modal Generative AI-combining vision and language models-can be applied to transform raw inspection data (images + text) into structured, actionable maintenance reports.Participants will learn to build a GenAI-powered inspection assistant that analyzes images (e.g., solar panel defects, pipeline anomalies) and corresponding technician notes to generate human-readable reports. The session bridges computer vision, natural language processing, and domain-specific prompts to automate tasks traditionally done by expert operators, thus enhancing safety, efficiency, and compliance in the energy sector.This is a hands-on session with synthetic data and open-source tools to empower participants to prototype and deploy multi-modal GenAI solutionsKey Technologies & Tools",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/multi-modal-genai-for-energy-infrastructure-inspection-reports"
    },
    {
      "title": "From Vision to Action: Multi-Modal Agentic AI in Real-World Use",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Pradeep Kumar",
          "designation": "Senior Software Engineer"
        }
      ],
      "about": "Modern AI systems are evolving to see, reason and act. In this session, we explore designing an agentic AI system that combines computer vision with large language models (LLMs) to detect uniforms and trigger intelligent, context-aware events like granting access, sending alerts, or logging events. The system architecture includes prompt chaining, lightweight APIs, and agent frameworks, along with safeguards like confidence thresholds and human-in-the-loop logic. Attendees will gain insights into how such systems can be applied across aviation, logistics, retail, and security integrating perception, reasoning, and response for scalable, responsible automation. The session closes with a hands-on demo using synthetic visual inputs and real-time LLM-based decision-making.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/from-vision-to-action-multi-modal-agentic-ai-in-real-world-use"
    },
    {
      "title": "Aligning Responsible AI with Probabilistic World of LLMs & Agents",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Shubhradeep Nandi",
          "designation": "Chief Data Scientist"
        }
      ],
      "about": "In the rapidly evolving AI ecosystem, large language models (LLMs) and autonomous agents have become central to decision-making systems-from fraud detection and credit scoring to welfare distribution. However, these systems operate on probabilities and confidence scores, not absolutes. That poses a critical challenge: How do we ensure fairness, accountability, and trust when AI decisions are inherently uncertain? This talk offers a deep dive into aligning Responsible AI principles with the probabilistic nature of modern AI systems. We explore how to architect systems that not only predict, but also explain, justify, and remain auditable drawing from real-world implementations in financial oversight. We will show the following: This session will empower AI Engineers, Data Scientists, Business Leaders, Auditors, and policymakers alike to navigate probabilistic AI outcomes without compromising on transparency, ethics, or stakeholder trust.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/aligning-responsible-ai-with-probabilistic-world-of-llms-agents"
    },
    {
      "title": "Post‑Training Is Back: From Prompts to Policies",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Aashay Sachdeva",
          "designation": "Founding Team/ML"
        }
      ],
      "about": "This session, \"Post-Training Is Back: From Prompts to Policies,\" explores the resurgence of post-training techniques in the development and alignment of large language models (LLMs). We begin by analyzing the current plateau in prompt engineering, where simple prompt tweaks deliver only short-term, brittle solutions that don’t scale to complex or long-term objectives. The session explains why post-training is regaining importance, driven by the democratization of fine-tuning pipelines and reward-model toolkits. As LLMs are increasingly deployed in critical real-world applications, we need robust, policy-driven alignment methods that can go beyond input tweaking and deliver reliable, safe behavior at scale. We introduce new paradigms such as leveraging test-time computation for improved policy learning and demonstrate how integrating tool use with reinforcement learning (RL) leads to better, more capable agents. We will detail the challenges in this transition and highlight the opportunities it unlocks for both research and industrial deployment. Attendees will see practical applications such as fine-tuning LLMs to adhere to organization-specific policies, including regulatory compliance in sectors like Indian finance or healthcare. The session will also demonstrate how reward models and verifiable rewards can teach agents complex multi-step tasks, like support automation or conversational assistants that reason over extensive documents. Furthermore, we will explore integrating external tools-such as calculators, code execution, and web search-with LLMs using RL to enhance capabilities in areas like customer support, education, and data analytics. A live code demo will specifically illustrate how to train an LLM to properly invoke external APIs or tools, such as weather or web search functions, showcasing RL for tool use in action.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/posttraining-is-back-from-prompts-to-policies"
    },
    {
      "title": "Human-In-The-Loop Agentic Systems",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Deepak Sharma",
          "designation": "Senior Machine Learning Engineer"
        }
      ],
      "about": "Agentic AI systems are emerging as a key frontier in advancing intelligence, with early adoption seen in areas like deep research, software development, and customer service. Despite their promise, current systems struggle with reliability and can be unpredictable for simpler tasks as well. This limits their use to tasks where lower reliability can be managed. To unlock broader applications, we need to rethink how these systems are built. By designing workflows that incorporate human-in-the-loop interfaces, we can balance AI-driven execution with human-guided planning and ideation. This talk will showcase how such an approach can enable more complex, high-stakes tasks-demonstrated through a real-world deep research example. The practical implementations of Human-In-The-Loop Agentic Systems span a variety of complex tasks. In deep research, these systems can assist in navigating vast amounts of information and synthesizing insights. For consumers, they can facilitate complex planning, such as organizing intricate travel itineraries or guiding high-value purchases by providing structured information and suggestions. Businesses can leverage these agents for critical planning activities like optimizing supplier selection, streamlining inventory management, and enhancing overall business process management. These applications highlight how human-in-the-loop design can elevate the reliability and effectiveness of AI for demanding and high-stakes scenarios.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/human-in-the-loop-agentic-systems"
    },
    {
      "title": "Building a Scalable Healthcare Voice AI Contact Center with Pipecat",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Ashish Tripathy",
          "designation": "CTO and Co-Founder"
        }
      ],
      "about": "This session offers a comprehensive guide to building a scalable Voice AI Contact Center using PipeCat. Pipecat is an open-source Python framework for building real-time voice and multimodal conversational agents. You'll learn how to design, implement, and deploy a voice-powered system capable of handling patient appointment scheduling, answering common medical queries, and intelligently escalating complex issues to a supervisor (either a secondary voice-agent or a human). The session will begin with an introduction to PipeCat and Voice AI Fundamentals, explaining how PipeCat orchestrates speech-to-speech pipelines by layering LLM-driven logic on top of telephony transports like Twilio or WebRTC. We will demonstrate how PipeCat handles latency, interruption management, and context tracking effectively. The workshop will then delve into building a healthcare booking and support workflow, showing how to capture patient speech, transcribe it, invoke LLM function calls to backend appointment-booking APIs, and synthesize audio replies. You'll also learn how to embed domain-specific knowledge (e.g., clinic hours, insurance policies) into prompt templates for efficient FAQ answering. We will then cover designing multiple voice personalities and supervision logic, including configuring distinct TTS voices (e.g., a friendly \"Receptionist\" and a formal \"Supervisor\" voice for escalations). You'll discover how PipeCat simplifies switching personalities based on sentiment or intent detection, and how to route calls to a live human agent when needed. Finally, we will discuss scaling and deploying your contact center, outlining best practices for horizontal scaling through containerizing PipeCat workers, configuring autoscaling groups, monitoring per-minute costs of STT/TTS/LLM calls, and implementing caching or context summarization to reduce expensive long-session inference, ensuring sub-second voice-to-voice latency even under heavy load. The practical applications covered will include automated appointment booking, where we'll build a PipeCat handler that transcribes patient speech, extracts entities via an LLM function call, and interacts with a REST API to check slot availability, confirming appointments with synthesized TTS responses. We will also demonstrate how to answer insurance and billing queries by embedding a small knowledge base of insurance coverage rules and matching queries to preloaded FAQ text or LLM prompts to synthesize confident audio replies based on clinic policy tables. Furthermore, we will configure dynamic personality switching and escalation, setting up two TTS voices (\"Front Desk\" and \"Supervisor\") and illustrating how PipeCat triggers a personality switch based on sentiment analysis, flagging emergencies or complex issues and either engaging another PipeCat instance or bridging the call to a live human operator.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/building-a-scalable-healthcare-voice-ai-contact-center-with-pipecat"
    },
    {
      "title": "Scaling Test-time Inference Compute & Advent of Reasoning Models",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Jayita Bhattacharyya",
          "designation": "Data Scientist"
        }
      ],
      "about": "Enabling LLMs to enhance their outputs through increased test-time computation is a crucial step toward building self-improving agents capable of handling open-ended natural language tasks. This session explores how allowing a fixed but non-trivial amount of inference-time compute can impact performance on challenging prompts—an area with significant implications for LLM pretraining strategies and the trade-offs between inference-time and pretraining compute. Reasoning-focused LLMs, particularly open-source ones, are now challenging closed models with comparable performance using less compute. We’ll explore the mechanisms behind this shift, including Chain-of-Thought (CoT) prompting and reinforcement learning-based reward modeling. The session will cover the architectures, benchmarks, and performance of next-gen reasoning models through hands-on code walkthroughs. Topics include foundational LLM architectures (pre/post-training and inference), zero-shot CoT prompting (without RL), RL-based reasoning enhancements (beam search, Best-of-N, lookahead), and a comparison of fine-tuning strategies Supervised Fine-Tuning (SFT), Direct Preference Optimization (DPO), and Generalized Rejection-based Preference Optimization (GRPO)). Finally, we'll demonstrate how to run and fine-tune models efficiently using the Unsloth.ai framework on limited compute setups.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/scaling-test-time-inference-compute-advent-of-reasoning-models"
    },
    {
      "title": "The Missing Piece of AI Apps: Evaluation",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Ayush Thakur",
          "designation": "Machine Learning Engineer"
        }
      ],
      "about": "In this hack session, we will learn about techniques for building, optimizing, and scaling LLM-as-a-judge evaluators with minimal human input. We will learn about the inherent bias, how to mitigate them and most importantly how to align with human preferences. This hack-session is a fast-paced, hands-on session that shows practitioners how to turn “it works on my prompt” demos into production-ready AI systems that they can trust. Drawing on the material fromLLM Apps: Evaluation(created with Google AI and Open Hands), the hack session walks you through the complete evaluation lifecycle: Attendees leave with an evaluation playbook, starter notebooks, and an intuition for when to combine humans, rules and LLM judges to hit reliability targets without slowing iteration.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/no-title-3"
    },
    {
      "title": "Agentify Go-To-Market: Build Sales & Marketing AI Agents with MCP",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Qingyun Wu",
          "designation": "Co-creator and Co-founder"
        }
      ],
      "about": "Discover how to transform the way Sales and Marketing teams operate by building AI agents that understand, reason, and act - all powered by MCP (Model Context Protocol).💡 Example Agents You Can Build: By the end, you’ll have deployed real AI agents - powered by MCP - that could run parts of a go-to-market team on their own.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/agentify-go-to-market-build-sales-marketing-ai-agents-with-mcp"
    },
    {
      "title": "From Idea to Production with GenAI : Realizing the Art of the Possible",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Karan Sindwani",
          "designation": "Senior Applied Scientist"
        }
      ],
      "about": "In this session, I will share practical insights from actual production deployments of GenAI applications across multiple industries. Drawing from my experience with AWS, I will demonstrate: 1. Building a Customer Service Solution for Production - You will learn how we: 2. Automated Cricket Scene Analysis with Vision Language Models - I will show how we: 3. Gen AI-based Data Analyst - I will demonstrate how we:",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/from-idea-to-production-with-genai-realizing-the-art-of-the-possible"
    },
    {
      "title": "Agents at Scale: Engineering Reliable GenAI Systems for Production",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Kartik Nighania",
          "designation": "MLOps Engineer"
        }
      ],
      "about": "This hands-on session reveals battle-tested strategies for scaling AI agents from prototype to production. We'll cover critical engineering practices including robust monitoring systems, comprehensive logging frameworks, automated testing pipelines, and CICD workflows optimized for agent deployments. Participants will learn concrete techniques to detect hallucinations, measure reliability metrics, and implement guardrails that ensure consistent agent performance under real-world conditions. Join us for practical insights on building GenAI systems that don't just work in demos, but deliver dependable value in production environments.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/agents-at-scale-engineering-reliable-genai-systems-for-production"
    },
    {
      "title": "Detecting and Mitigating Risks in Agentic AI",
      "type": "Hack Session",
      "speakers": [
        {
          "name": "Bhaskarjit Sarmah",
          "designation": "Head of Financial Services AI Research"
        }
      ],
      "about": "Autonomous AI agents promise super-charged productivity but without the right guardrails they can also jailbreak, leak data, or go off-topic. In this session we will discuss about: What we will build -In the hands-on segment we will build a complete agent to go from blank notebook to governed production prototype. We’ll begin by bootstrapping a one-file Python agent with LangChain and OpenAI Functions that can plan, call external APIs, and write concise summaries. Next, we’ll wrap that agent with the open-source Python libraries, layering in rate-limits, PII scrubbing, and role-based tool permissions so you can see policy enforcement in action. With guardrails in place, we’ll shift to offense - running an automated PyTest suite populated with the red-team prompts to expose prompt-injection and tool-abuse weak spots. We’ll then quantify how well the patched agent stays on-mission by applying a lightweight PRISM-style alignment rubric that emits a JSON scorecard. Finally, we’ll wire everything into a Streamlit mini-dashboard that streams agent actions, policy hits, and manual override controls in real time, giving a turnkey template we can fork for our next project.",
      "url": "https://www.analyticsvidhya.com/datahacksummit-2025/sessions/detecting-and-mitigating-risks-in-agentic-aino-title"
    }
  ]
}